#pragma once

#include <Arduino.h>
#include <map>

inline String gbk_wifi_waiting_connect = "连接中...";
inline String gbk_wifi_connected = "已连接";

// 定义映射表
inline std::map<long, String> teamMap = {
    {10273, "广东"}, {10326, "江苏"}, {10360, "天津"}, {10727, "山东"}, {11380, "四川"}, {10361, "青岛"}, {10721, "吉林"}, {10724, "新疆"}, {10732, "福建"}, {36563, "宁波"}, {10722, "浙江"}, {10728, "辽宁"}, {10729, "广厦"}, {10734, "山西"}, {10793, "同曦"}, {10725, "广州"}, {10726, "北京"}, {10730, "深圳"}, {10731, "上海"}, {11072, "北控"}};
